;-*- mode: Org; fill-column:120; org-src-fontify-natively:t; buffer-read-only: t;-*- or emacs -f view-mode
#+LATEX_HEADER: \usepackage[T1,T2A]{fontenc}
#+STARTUP: content

For beginers: https://systemcrafters.net/emacs-from-scratch/

emacs news: https://emacsredux.com/

https://github.com/emacs-tw/awesome-emacs

programin book in Org https://github.com/chansey97/SICP-Sage https://github.com/ilmotta/sicp-org

example init
- erc https://dataswamp.org/~incal/emacs-init/
- https://github.com/steelkiwi/emacs.d
- https://github.com/alexott/emacs-configs
- Org Magit Ivy Evil vterm Eshell Dired lsp-mode-ivy typescript https://github.com/daviwil/emacs-from-scratch/blob/master/init.el
- org and shit https://susamn.medium.com/ultimate-emacs-setup-with-documentation-in-org-mode-8ed32e2b3487
- full https://emacs.readthedocs.io/en/latest/general.html
- org notes with mobile orgzly http://www.howardism.org/Technical/Emacs/getting-more-boxes-done.html
- agenda https://github.com/opsnull/emacs
- good girl https://github.com/sachac
- her blog https://sachachua.com/blog/
- My ten most used features https://www.youtube.com/watch?v=cSWXXJKqZ-A
- org config https://www.omarpolo.com/dots/emacs.html
- Clojure Lisp Rust JS Email Company Magit https://github.com/vedang/emacs-up
- Evil user, multilanguage programmer https://github.com/erickgnavar
- sci-hub.se fan, dired, exmw, transmission, elfeed, tex, Latex https://git.pixie.town/pinoaffe/emacs-config/src/branch/master/init.org
- grym - discriminitive AI, some graph based

keys https://www.math.uh.edu/~bgb/Links/emacs_keys.html

TODO https://steelkiwi.com/blog/emacs-configuration-working-python/
TODO videos https://www.youtube.com/user/emacsrocks/videos
TODO https://sites.google.com/site/steveyegge2/effective-emacs
**** serialize with PyYAML
dev-python/pyyaml
#+name: yamlmy
#+begin_src yaml
aa:
  - b
  - 'c"as"c'

---
s: asd
#+end_src

#+begin_src python :results output :exports both :noweb yes
import yaml
for data in yaml.load_all("""
<<yamlmy>>""", yaml.SafeLoader):
    print(data)
#+end_src

#+RESULTS:
: {'aa': ['b', 'c"as"c']}
: {'s': 'asd'}

**** example output json
#+begin_src shell :results output :wrap EXPORT javascript
curl -X GET "http://anonchek.ru/get?id=a43219ce4a4a490d9cd34beb718cb09f" -H  "accept: application/json"
#+end_src

#+RESULTS:
#+begin_EXPORT javascript
{
    "status": "ready",
    "pages": [
        {
            "document_type": 0,
            "qc": 0,
            "file_uuid": "2c68c75b42254df0aa150a5b30d791a8"
        }
    ],
    "time_seconds": 0.99
}
#+end_EXPORT

*** python sessions
#+begin_src python
#+BEGIN_SRC python :results output :session a
import numpy
import pandas as pd
v = pd.DataFrame({'as':[1,2], 'ssd':[3,2]})
print(v)
#+END_SRC

#+RESULTS:
:    as  ssd
: 0   1    3
: 1   2    2

#+BEGIN_SRC python :results output :session a
print(v.describe())
#+END_SRC

#+RESULTS:
:              as       ssd
: count  2.000000  2.000000
: mean   1.500000  2.500000
: std    0.707107  0.707107
: min    1.000000  2.000000
: 25%    1.250000  2.250000
: 50%    1.500000  2.500000
: 75%    1.750000  2.750000
: max    2.000000  3.000000

#+end_src
**** original - not working with sessions
#+name: pd2org
#+begin_src python :var df="df" :exports none
return f"return tabulate({df}, headers={df}.columns, tablefmt='orgtbl')"
#+end_src


#+header: :noweb strip-export
#+header: :prologue from tabulate import tabulate
#+begin_src python :results value raw :exports both
import pandas as pd
df = pd.DataFrame({
      "a": [1,2,3],
      "b": [4,5,6]
})
<<pd2org("df")>>
#+end_src

#+RESULTS:
|   | a | b |
|---+---+---|
| 0 | 1 | 4 |
| 1 | 2 | 5 |
| 2 | 3 | 6 |

**** with sessions
#+header: :prologue from tabulate import tabulate
#+begin_src python :results value raw :exports both :session a
import pandas as pd

def pd2org(df_to_table):
    "can be used any blocks in same session"
    return tabulate(df_to_table, headers=df_to_table.columns, tablefmt='orgtbl')

df = pd.DataFrame({
      "a": [1,2,3],
      "b": [4,5,6]
})
pd2org(df.describe())
#+end_src

#+RESULTS:
|       |   a |   b |
|-------+-----+-----|
| count |   3 |   3 |
| mean  |   2 |   5 |
| std   |   1 |   1 |
| min   |   1 |   4 |
| 25%   | 1.5 | 4.5 |
| 50%   |   2 |   5 |
| 75%   | 2.5 | 5.5 |
| max   |   3 |   6 |

*** shell sorce code blocks
for shell:

#+begin_src sh :results output :noweb yes
set -- "2\n22"
<<aa3>>
#+end_src

#+RESULTS:
: 2
: 22

#+name: aa3
#+begin_src shell :exports none
echo -e "$@"
#+end_src

this works like #include in C:

#+begin_src python :results output :noweb yes
print('<<aa3>>')
#+end_src

#+RESULTS:
: echo -e "$@"

#+name: aa3
#+begin_src shell :exports none
echo -e "$@"
#+end_src

**** ex with :var x=name
#+NAME: aaa
#+begin_src python :session s1
a = 2
#+end_src


#+begin_src python :var x=aaa :results output :exports both :session s1
print(a)
#+end_src

#+RESULTS:
: 2

*** org-babel-eval (command query)
ob-eval.el

org-babel--shell-command-on-region

process-file("/bin/bash" "/tmp/babel-r8qnrq/ob-input-NupvRT" (t "/tmp/babel-r8qnrq/ob-error-cNDFv1") nil "-c" "mypy")

call-process "/bin/bash" "/tmp/babel-r8qnrq/ob-input-ZiSUmz" (t "/tmp/emacsIHqeyU") nil ("-c" "mypy")

call-process "/bin/bash" "~/aaa" (t "/tmp/emacsIHqeyU") nil ("-c" "mypy")

#+begin_src elisp :results output :exports both
(call-process "/bin/bash" "~/aaa" t nil "-c" "python")
#+end_src

#+begin_src elisp :results output :exports both
(call-process "/bin/bash" "~/aaa" t nil "-c" "mypy")
#+end_src

#+begin_src elisp :results output :exports both
(call-process "/bin/bash" "~/aaa" t nil "-c" "/usr/local/bin/mypy.sh")
#+end_src

#+begin_src python :python "/usr/local/bin/mypy.sh" :results output :exports both
print("wes")
#+end_src

#+RESULTS:
: Success: no issues found in 1 source file

*** calc source block
#+name: myname
#+begin_src python :results output
print(34)
#+end_src

#+RESULTS: myname
: 34

| a | b |  c |
|---+---+----|
|   |   | 34 |
#+TBLFM: @2$3='(org-sbe myname)


*** get ip
#+begin_src http :curl -A "wget"
GET ifconfig.co/ip
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 200 OK
Date: Fri, 03 May 2024 08:13:30 GMT
Content-Type: text/plain; charset=utf-8
Content-Length: 16
Connection: keep-alive
CF-Cache-Status: DYNAMIC
Report-To: {"endpoints":[{"url":"https:\/\/a.nel.cloudflare.com\/report\/v4?s=wLdwP9Jubtuy5N82wTlYUTBOBiTnos2Vpxs9UKGFlcAHz%2BgwXlsHwLm%2BbgDX%2BrXnyo3hT3ND%2FjelVpJZC8l%2FEEzWNZZ4jdjyX4awnhCsGuMe9F%2FBVaREUa5bx%2BSbZQ%3D%3D"}],"group":"cf-nel","max_age":604800}
NEL: {"success_fraction":0,"report_to":"cf-nel","max_age":604800}
Server: cloudflare
CF-RAY: 87decac65829052b-OTP
alt-svc: h3=":443"; ma=86400

217.196.104.210
#+end_example

#+begin_src bash
curl -A "wget" ifconfig.co/ip
#+end_src

#+RESULTS:
: 217.196.104.210

*** json source block
#+begin_src http
#+BEGIN_SRC http :pretty
POST http://httpbin.org/post
Content-Type: application/json

{
  "key": "value"
}
#+END_SRC

#+RESULTS:
#+begin_example
{
  "url": "http://httpbin.org/post",
  "json": {
    "key": "value"
  },
  "headers": {
    "User-Agent": "curl/7.35.0",
    "Host": "httpbin.org",
    "Content-Type": "application/json",
    "Content-Length": "18",
    "Accept": "*/*"
  },
  "form": {},
  "files": {},
  "data": "{  \"key\": \"value\"}",
  "args": {}
}
#+end_example
#+end_src
